; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v2 ?v10)
             (pred_6 ?v8 ?v3)
             (pred_11 ?v2 ?v3)
             (pred_1 ?v1 ?v2 )
	     (pred_7 ?v2)
             (pred_9 ?v4)
             (pred_8 ?v8)
             (pred_12 ?v3)
             (pred_3 ?v2)
             (pred_5 ?v8)
             (pred_4 ?v2)
             (pred_2 ))



(:action op_4
:parameters (?v12 ?v6 ?v5 ?v7)
:precondition (and (pred_9 ?v12) (pred_9 ?v6) (pred_8 ?v5) (pred_12 ?v7)
          (pred_10 ?v12 ?v6) (pred_6 ?v5 ?v7)
                   (pred_11 ?v6 ?v7) (pred_7 ?v12) 
                   (pred_3 ?v6) (pred_5 ?v5))
:effect (and  (pred_4 ?v6) (not (pred_3 ?v6))))


(:action op_2
:parameters (?v12 ?v11)
:precondition (and (pred_9 ?v12) (pred_9 ?v11)
               (pred_7 ?v12) (pred_10 ?v12 ?v11) (pred_4 ?v11))
:effect (and (pred_7 ?v11) (not (pred_7 ?v12))))

(:action op_5
:parameters (?v12 ?v5)
:precondition (and (pred_9 ?v12) (pred_8 ?v5) 
                  (pred_7 ?v12) (pred_1 ?v5 ?v12) (pred_2 ))
:effect (and (pred_5 ?v5)
   (not (pred_1 ?v5 ?v12)) (not (pred_2 ))))


(:action op_3
:parameters (?v12 ?v9 ?v13)
:precondition (and (pred_9 ?v12) (pred_8 ?v9) (pred_8 ?v13)
                  (pred_7 ?v12) (pred_5 ?v13) (pred_1 ?v9 ?v12))
:effect (and (pred_5 ?v9) (pred_1 ?v13 ?v12)
        (not (pred_5 ?v13)) (not (pred_1 ?v9 ?v12))))

(:action op_1
:parameters (?v12 ?v5)
:precondition (and (pred_9 ?v12) (pred_8 ?v5) 
                  (pred_7 ?v12) (pred_5 ?v5))
:effect (and (pred_2 ) (pred_1 ?v5 ?v12) (not (pred_5 ?v5)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_29 obj_08 obj_09 obj_12 obj_21 obj_22 obj_03 obj_30 obj_17 obj_28 obj_19 obj_25 obj_02 obj_13 obj_23 obj_05 obj_24 obj_10 obj_07 obj_16 obj_26 obj_18 obj_27 obj_04
    obj_14 obj_01
    obj_20 obj_15 obj_11
    )

    (:init
       (pred_2)

       (pred_9 obj_06)
       (pred_9 obj_29)
       (pred_9 obj_08)
       (pred_9 obj_09)
       (pred_9 obj_12)
       (pred_9 obj_21)
       (pred_9 obj_22)
       (pred_9 obj_03)
       (pred_9 obj_30)
       (pred_9 obj_17)
       (pred_9 obj_28)
       (pred_9 obj_19)
       (pred_9 obj_25)
       (pred_9 obj_02)
       (pred_9 obj_13)
       (pred_9 obj_23)
       (pred_9 obj_05)
       (pred_9 obj_24)
       (pred_9 obj_10)
       (pred_9 obj_07)
       (pred_9 obj_16)
       (pred_9 obj_26)
       (pred_9 obj_18)
       (pred_9 obj_27)
       (pred_9 obj_04)
       (pred_12 obj_14)
       (pred_12 obj_01)
       (pred_8 obj_20)
       (pred_8 obj_15)
       (pred_8 obj_11)

       (pred_10 obj_06 obj_21)
       (pred_10 obj_06 obj_29)
       (pred_10 obj_29 obj_22)
       (pred_10 obj_29 obj_08)
       (pred_10 obj_29 obj_06)
       (pred_10 obj_08 obj_03)
       (pred_10 obj_08 obj_09)
       (pred_10 obj_08 obj_29)
       (pred_10 obj_09 obj_30)
       (pred_10 obj_09 obj_12)
       (pred_10 obj_09 obj_08)
       (pred_10 obj_12 obj_17)
       (pred_10 obj_12 obj_09)
       (pred_10 obj_21 obj_28)
       (pred_10 obj_21 obj_22)
       (pred_10 obj_21 obj_06)
       (pred_10 obj_22 obj_19)
       (pred_10 obj_22 obj_03)
       (pred_10 obj_22 obj_29)
       (pred_10 obj_22 obj_21)
       (pred_10 obj_03 obj_25)
       (pred_10 obj_03 obj_30)
       (pred_10 obj_03 obj_08)
       (pred_10 obj_03 obj_22)
       (pred_10 obj_30 obj_02)
       (pred_10 obj_30 obj_17)
       (pred_10 obj_30 obj_09)
       (pred_10 obj_30 obj_03)
       (pred_10 obj_17 obj_13)
       (pred_10 obj_17 obj_12)
       (pred_10 obj_17 obj_30)
       (pred_10 obj_28 obj_23)
       (pred_10 obj_28 obj_19)
       (pred_10 obj_28 obj_21)
       (pred_10 obj_19 obj_05)
       (pred_10 obj_19 obj_25)
       (pred_10 obj_19 obj_22)
       (pred_10 obj_19 obj_28)
       (pred_10 obj_25 obj_24)
       (pred_10 obj_25 obj_02)
       (pred_10 obj_25 obj_03)
       (pred_10 obj_25 obj_19)
       (pred_10 obj_02 obj_10)
       (pred_10 obj_02 obj_13)
       (pred_10 obj_02 obj_30)
       (pred_10 obj_02 obj_25)
       (pred_10 obj_13 obj_07)
       (pred_10 obj_13 obj_17)
       (pred_10 obj_13 obj_02)
       (pred_10 obj_23 obj_16)
       (pred_10 obj_23 obj_05)
       (pred_10 obj_23 obj_28)
       (pred_10 obj_05 obj_26)
       (pred_10 obj_05 obj_24)
       (pred_10 obj_05 obj_19)
       (pred_10 obj_05 obj_23)
       (pred_10 obj_24 obj_18)
       (pred_10 obj_24 obj_10)
       (pred_10 obj_24 obj_25)
       (pred_10 obj_24 obj_05)
       (pred_10 obj_10 obj_27)
       (pred_10 obj_10 obj_07)
       (pred_10 obj_10 obj_02)
       (pred_10 obj_10 obj_24)
       (pred_10 obj_07 obj_04)
       (pred_10 obj_07 obj_13)
       (pred_10 obj_07 obj_10)
       (pred_10 obj_16 obj_26)
       (pred_10 obj_16 obj_23)
       (pred_10 obj_26 obj_18)
       (pred_10 obj_26 obj_05)
       (pred_10 obj_26 obj_16)
       (pred_10 obj_18 obj_27)
       (pred_10 obj_18 obj_24)
       (pred_10 obj_18 obj_26)
       (pred_10 obj_27 obj_04)
       (pred_10 obj_27 obj_10)
       (pred_10 obj_27 obj_18)
       (pred_10 obj_04 obj_07)
       (pred_10 obj_04 obj_27)
       (pred_3 obj_30)
       (pred_3 obj_18)
       (pred_3 obj_04)
       (pred_11  obj_30 obj_14)
       (pred_11  obj_18 obj_01)
       (pred_11  obj_04 obj_14)
       (pred_4 obj_06)
       (pred_4 obj_29)
       (pred_4 obj_08)
       (pred_4 obj_09)
       (pred_4 obj_12)
       (pred_4 obj_21)
       (pred_4 obj_22)
       (pred_4 obj_03)
       (pred_4 obj_17)
       (pred_4 obj_28)
       (pred_4 obj_19)
       (pred_4 obj_25)
       (pred_4 obj_02)
       (pred_4 obj_13)
       (pred_4 obj_23)
       (pred_4 obj_05)
       (pred_4 obj_24)
       (pred_4 obj_10)
       (pred_4 obj_07)
       (pred_4 obj_16)
       (pred_4 obj_26)
       (pred_4 obj_27)

       (pred_6  obj_20 obj_14)
       (pred_6  obj_15 obj_01)
       (pred_6  obj_11 obj_14)
       (pred_1 obj_20 obj_02)
       (pred_1 obj_15 obj_08)
       (pred_1 obj_11 obj_08)
       (pred_7 obj_12)
    )

    (:goal (and
       (pred_1 obj_20 obj_22)
       (pred_1 obj_15 obj_06)
       (pred_1 obj_11 obj_09)
    ))
(:constraints
  (always (not (pred_7 obj_29)))
)
)

; plan
1. (op_2 obj_12 obj_09)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_09)
   goals met: 0 of 3
2. (op_2 obj_09 obj_08)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_08)
   goals met: 0 of 3
3. (op_5 obj_08 obj_11)
   deleted: (pred_1 obj_11 obj_08) (pred_2)
   added: (pred_5 obj_11)
   goals met: 0 of 3
4. (op_2 obj_08 obj_09)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_09)
   goals met: 0 of 3
5. (op_4 obj_09 obj_30 obj_11 obj_14)
   deleted: (pred_3 obj_30)
   added: (pred_4 obj_30)
   goals met: 0 of 3
6. (op_1 obj_09 obj_11)
   deleted: (pred_5 obj_11)
   added: (pred_2) (pred_1 obj_11 obj_09)
   goals met: 1 of 3
7. (op_2 obj_09 obj_08)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_08)
   goals met: 1 of 3
8. (op_5 obj_08 obj_15)
   deleted: (pred_1 obj_15 obj_08) (pred_2)
   added: (pred_5 obj_15)
   goals met: 1 of 3
9. (op_2 obj_08 obj_09)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_09)
   goals met: 1 of 3
10. (op_2 obj_09 obj_30)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_30)
   goals met: 1 of 3
11. (op_2 obj_30 obj_02)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_02)
   goals met: 1 of 3
12. (op_3 obj_02 obj_20 obj_15)
   deleted: (pred_5 obj_15) (pred_1 obj_20 obj_02)
   added: (pred_5 obj_20) (pred_1 obj_15 obj_02)
   goals met: 1 of 3
13. (op_2 obj_02 obj_25)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_25)
   goals met: 1 of 3
14. (op_2 obj_25 obj_19)
   deleted: (pred_7 obj_25)
   added: (pred_7 obj_19)
   goals met: 1 of 3
15. (op_2 obj_19 obj_22)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_22)
   goals met: 1 of 3
16. (op_1 obj_22 obj_20)
   deleted: (pred_5 obj_20)
   added: (pred_2) (pred_1 obj_20 obj_22)
   goals met: 2 of 3
17. (op_2 obj_22 obj_03)
   deleted: (pred_7 obj_22)
   added: (pred_7 obj_03)
   goals met: 2 of 3
18. (op_2 obj_03 obj_30)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_30)
   goals met: 2 of 3
19. (op_2 obj_30 obj_02)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_02)
   goals met: 2 of 3
20. (op_5 obj_02 obj_15)
   deleted: (pred_1 obj_15 obj_02) (pred_2)
   added: (pred_5 obj_15)
   goals met: 2 of 3
21. (op_2 obj_02 obj_30)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_30)
   goals met: 2 of 3
22. (op_2 obj_30 obj_03)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_03)
   goals met: 2 of 3
23. (op_2 obj_03 obj_22)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_22)
   goals met: 2 of 3
24. (op_2 obj_22 obj_21)
   deleted: (pred_7 obj_22)
   added: (pred_7 obj_21)
   goals met: 2 of 3
25. (op_2 obj_21 obj_06)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_06)
   goals met: 2 of 3
26. (op_1 obj_06 obj_15)
   deleted: (pred_5 obj_15)
   added: (pred_2) (pred_1 obj_15 obj_06)
   goals met: 3 of 3
